app/views/shared/_header.html.erb

          <%= link_to cart_path(@cart) do %>
            <i class="fas fa-shopping-cart"></i>Cart <span class="cart"><%= @cart.line_items.count %></span>
---
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 14]]