app/views/carts/show.html.erb

  <div class="container">
    <h3 class="title"><%= @cart.line_items.count %> item(s) in <%= @title %></h3>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 6]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]