app/controllers/products_controller.rb

  def index
    if params[:year] and params[:model] and params[:make]
      #@products = Product.where('model LIKE ?', "%#{params[:model]}")
      #@products = Product.where('year = ? and model = ?', "%#{params[:year]}", "%#{params[:model]}")
      #@products = Product.where("year= ?", "%#{params[:year]}")
      @products = Product.where("year = ? and model = ? and make = ?", params[:year], params[:model], params[:make])
    else
      @products = Product.all.order("created_at desc")
---
SELECT "products".* FROM "products" WHERE "products"."year" = ? AND "products"."model" = ?  [["year", "%2015"], ["model", "%ford"]]
SELECT "products".* FROM "products" ORDER BY created_at desc

  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("brand", "name", "itemNum", "desc", "brandName", "year", "make", "model", "price", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)